%INFO: 本函数用来解析元胞参数ion
%%----------------------------------------------------------------------%%
% Needs: constants.m; 
%%----------------------------------------------------------------------%%
% Inputs:
%   ion         - 包含离子名称的元胞数组 cell
% Outputs:
%   mi          - 离子质量 [kg]
%   qi          - 离子电荷量 [C]
%%----------------------------------------------------------------------%%
% author: Washy[IGG]
% date: 2019/08/20
%%----------------------------------------------------------------------%%
%%更新内容[Washy 2020/04/30]
% 1. 去除if语句, 使用了新的解析方式
%%----------------------------------------------------------------------%%
%输入测试示例[2019/08/20]
% ion = {'NO+','O+'}; % {'O+'}
%%----------------------------------------------------------------------%%

function [mi, qi] = analysisIon(ion)

%检测输入变量类型
% validateattributes(ion,{'cell'},{'row'})

% 已定义离子成分
Ion = {'H+', 'He+', 'N+', 'O+', 'N2+', 'NO+', 'O2+'};

% 离子成分检测
[~, ia]= setdiff(ion, Ion);
if ia
    error(['未定义离子成分：' ion{ia}])
end

% 已定义离子成分对应质量和电荷数
m_q = [1.00784, 1; 4.00260, 1; 14.00643, 1; 15.99903, 1; 28.0129, 2; 
    30.5, 1; 31.9981, 2];

[~, ~, ib] = intersect(ion, Ion, 'stable');
res = constants({'mu','e'});

mi = m_q(ib, 1)*res.mu;
qi = m_q(ib, 2)*res.e;

end